Revit 2024 API
DGNExportOptions Constructor (DGNExportOptions)
 Constructs a new instance of DGNExportOptions as a copy of the export options.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public DGNExportOptions(
	DGNExportOptions option
)
Visual Basic
Public Sub New ( _
	option As DGNExportOptions _
)
Visual C++
public:
DGNExportOptions(
	DGNExportOptions^ option
)
Parameters
option
Type: Autodesk.Revit.DB.DGNExportOptions
 The options to be copied.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
DGNExportOptions Class
DGNExportOptions Overload
Autodesk.Revit.DB Namespace